# GAME ANALYSIS

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

In [2]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql mysql+pymysql://root:ShUfFlEs%401999@127.0.0.4:3306/game_analysis

Connecting to 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

In [3]:
%%sql 
# Query a few data from player_details

SELECT *
FROM player_details
LIMIT 5;

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

5 rows affected.

+-----------------+------+--------------------------+-----------+-----------+-------------+---------------+
| MyUnknownColumn | P_ID |          PName           | L1_Status | L2_Status |   L1_Code   |    L2_Code    |
+-----------------+------+--------------------------+-----------+-----------+-------------+---------------+
|        0        | 656  |  sloppy-denim-wolfhound  |     1     |     0     |   war_zone  |               |
|        1        | 358  |   skinny-grey-quetzal    |     0     |     0     |             |               |
|        2        | 296  |     silly-taupe-ray      |     1     |     0     |   war_zone  |               |
|        3        | 644  | randy-turquoise-scorpion |     1     |     1     | speed_blitz | cosmic_vision |
|        4        | 320  | chewy-harlequin-gharial  |     0     |     0     |             |               |
+-----------------+------+--------------------------+-----------+-----------+-------------+---------------+

In [4]:
%%sql 
# Query a few data from level_details2

SELECT *
FROM level_details2
LIMIT 5;

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

5 rows affected.

+-----------------+------+--------+---------------------+----------------+-------+------------+------------+-----------------+-------+--------------+
| MyUnknownColumn | P_ID | Dev_ID |      TimeStamp      | Stages_crossed | Level | Difficulty | Kill_Count | Headshots_Count | Score | Lives_Earned |
+-----------------+------+--------+---------------------+----------------+-------+------------+------------+-----------------+-------+--------------+
|        0        | 644  | zm_015 | 2022-10-11 14:05:08 |       3        |   1   |   Medium   |     11     |        5        |  350  |      1       |
|        1        | 644  | rf_015 | 2022-10-11 19:34:25 |       1        |   1   |    Low     |     7      |        2        |  150  |      0       |
|        2        | 644  | bd_017 | 2022-10-12 23:52:18 |       6        |   2   |   Medium   |     24     |        16       |  1750 |      2       |
|        3        | 656  | rf_013 | 2022-10-15 18:12:50 |       7        |   0   |   Medium   |     15     |        8        |  880  |      0       |
|        4        | 656  | bd_015 | 2022-10-13 22:19:45 |       4        |   1   |    Low     |     19     |        13       |  1450 |      0       |
+-----------------+------+--------+---------------------+----------------+-------+------------+------------+-----------------+-------+--------------+

In [5]:
%%sql 

# Make a few changes to the player_details table
alter table player_details modify L1_Status varchar(30);
alter table player_details modify L2_Status varchar(30);
alter table player_details modify P_ID int primary key;
alter table player_details drop myunknowncolumn;


# Make a few changes to the level_details2 table 
alter table level_details2 drop myunknowncolumn;
alter table level_details2 change timestamp start_datetime datetime;
alter table level_details2 modify Dev_Id varchar(10);
alter table level_details2 modify Difficulty varchar(15);
alter table level_details2 add primary key(P_ID,Dev_id,start_datetime);

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

30 rows affected.

30 rows affected.

77 rows affected.

77 rows affected.

77 rows affected.

++
||
++
++

In [6]:
%%sql 
# Query a few data from player_details

SELECT *
FROM player_details
LIMIT 5;

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

5 rows affected.

+------+-----------------------------+-----------+-----------+-----------+-----------------+
| P_ID |            PName            | L1_Status | L2_Status |  L1_Code  |     L2_Code     |
+------+-----------------------------+-----------+-----------+-----------+-----------------+
| 211  |    breezy-indigo-starfish   |     1     |     1     |  war_zone | splippery_slope |
| 224  |   nippy-peach-neanderthal   |     1     |     1     |  war_zone | splippery_slope |
| 242  | slaphappy-cinnamon-squirrel |     1     |     0     | bulls_eye |                 |
| 292  |    ugly-goldenrod-numbat    |     1     |     0     | bulls_eye |                 |
| 296  |       silly-taupe-ray       |     1     |     0     |  war_zone |                 |
+------+-----------------------------+-----------+-----------+-----------+-----------------+

In [7]:
%%sql 
# Query a few data from level_details2

SELECT *
FROM level_details2
LIMIT 5;

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

5 rows affected.

+------+--------+---------------------+----------------+-------+------------+------------+-----------------+-------+--------------+
| P_ID | Dev_Id |    start_datetime   | Stages_crossed | Level | Difficulty | Kill_Count | Headshots_Count | Score | Lives_Earned |
+------+--------+---------------------+----------------+-------+------------+------------+-----------------+-------+--------------+
| 211  | bd_013 | 2022-10-12 18:30:30 |       5        |   1   | Difficult  |     25     |        15       |  3200 |      2       |
| 211  | bd_017 | 2022-10-12 13:23:45 |       4        |   0   |    Low     |     20     |        15       |  390  |      2       |
| 211  | rf_013 | 2022-10-13 05:36:15 |       5        |   1   |   Medium   |     30     |        11       |  2700 |      1       |
| 211  | rf_017 | 2022-10-15 11:41:19 |       8        |   2   | Difficult  |     15     |        11       |  1100 |      1       |
| 211  | zm_015 | 2022-10-13 22:30:18 |       5        |   2   |    Low     |     14     |        8        |  2800 |      0       |
+------+--------+---------------------+----------------+-------+------------+------------+-----------------+-------+--------------+

# QUESTION 1
    Extract `P_ID`, `Dev_ID`, `PName`, and `Difficulty_level` of all players at Level 0.

In [8]:
%%sql 

SELECT pd.P_ID, ld.Dev_ID, pd.PName, ld.Difficulty
FROM player_details as pd
JOIN level_details2 as ld 
ON pd.P_ID = ld.P_ID
WHERE ld.Level = 0;

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

12 rows affected.

+------+--------+----------------------------+------------+
| P_ID | Dev_ID |           PName            | Difficulty |
+------+--------+----------------------------+------------+
| 211  | bd_017 |   breezy-indigo-starfish   |    Low     |
| 300  | zm_015 |    lanky-asparagus-gar     | Difficult  |
| 310  | bd_015 |     gloppy-tomato-wasp     | Difficult  |
| 358  | zm_013 |    skinny-grey-quetzal     |   Medium   |
| 358  | zm_017 |    skinny-grey-quetzal     |    Low     |
| 429  | bd_013 |    flabby-firebrick-bee    |   Medium   |
| 558  | wd_019 |    woozy-crimson-hound     | Difficult  |
| 632  | bd_013 | dorky-heliotrope-barracuda | Difficult  |
| 641  | rf_013 |     homey-alizarin-gar     |    Low     |
| 641  | rf_013 |     homey-alizarin-gar     | Difficult  |
+------+--------+----------------------------+------------+
Truncated to displaylimit of 10.

# Question 2 
    Find `Level1_code`wise average `Kill_Count` where `lives_earned` is 2, and at least 3 
    stages are crossed

In [9]:
%%sql 

SELECT pd.L1_Code, Avg(ld.Kill_Count) AS Avg_Kill_Count
FROM player_details as pd
JOIN level_details2 as ld
ON pd.P_ID = ld.P_ID
WHERE ld.Lives_Earned = 2
GROUP BY L1_Code
HAVING COUNT(ld.Stages_crossed) >= 3;

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

3 rows affected.

+-------------+----------------+
|   L1_Code   | Avg_Kill_Count |
+-------------+----------------+
|   war_zone  |    19.2857     |
|  bulls_eye  |    22.2500     |
| speed_blitz |    19.3333     |
+-------------+----------------+

# Question 3
    Find the total number of stages crossed at each difficulty level for Level 2 with players 
    using `zm_series` devices. Arrange the result in decreasing order of the total number of 
    stages crossed

In [10]:
%%sql 

SELECT Dev_ID, Difficulty, SUM(Stages_crossed) AS Total_stages_crossed
FROM  level_details2 
WHERE Level = 2 
AND Dev_ID LIKE 'zm%'
GROUP BY Difficulty, Dev_ID
ORDER BY Total_stages_crossed DESC

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

6 rows affected.

+--------+------------+----------------------+
| Dev_ID | Difficulty | Total_stages_crossed |
+--------+------------+----------------------+
| zm_017 | Difficult  |          39          |
| zm_017 |   Medium   |          21          |
| zm_015 |   Medium   |          14          |
| zm_017 |    Low     |          10          |
| zm_013 | Difficult  |          7           |
| zm_015 |    Low     |          5           |
+--------+------------+----------------------+

# Question 4 
    Extract `P_ID` and the total number of unique dates for those players who have played 
    games on multiple days

In [11]:
%%sql 

SELECT P_ID, COUNT(DISTINCT start_datetime)
FROM level_details2
GROUP BY P_ID

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

22 rows affected.

+------+--------------------------------+
| P_ID | COUNT(DISTINCT start_datetime) |
+------+--------------------------------+
| 211  |               6                |
| 224  |               4                |
| 242  |               2                |
| 292  |               2                |
| 296  |               2                |
| 300  |               5                |
| 310  |               3                |
| 319  |               1                |
| 358  |               2                |
| 368  |               4                |
+------+--------------------------------+
Truncated to displaylimit of 10.

# Question 5
    Find `P_ID` and levelwise sum of `kill_counts` where `kill_count` is greater than the 
    average kill count for Medium difficulty.

In [12]:
%%sql 

SELECT P_ID, Level, SUM(Kill_Count) AS Total_Kill
FROM level_details2
WHERE Difficulty = 'Medium'
GROUP BY P_ID, Level
HAVING SUM(Kill_Count) > AVG(Kill_Count)

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

3 rows affected.

+------+-------+------------+
| P_ID | Level | Total_Kill |
+------+-------+------------+
| 300  |   2   |     12     |
| 483  |   1   |     40     |
| 590  |   2   |     24     |
+------+-------+------------+

# Question 6 
    Find `Level` and its corresponding `Level_code`wise sum of lives earned, excluding Level 
    0. Arrange in ascending order of level.

In [13]:
%%sql 

SELECT ld.Level, pd.L1_Code, SUM(Lives_Earned)
FROM player_details as pd
JOIN level_details2 as ld
ON pd.P_ID = ld.P_ID
WHERE ld.Level != 0
GROUP BY ld.Level, pd.L1_Code
ORDER BY SUM(Lives_Earned) ASC

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

7 rows affected.

+-------+---------------+-------------------+
| Level |    L1_Code    | SUM(Lives_Earned) |
+-------+---------------+-------------------+
|   1   | leap_of_faith |         0         |
|   1   |   bulls_eye   |         5         |
|   1   |  speed_blitz  |         7         |
|   1   |    war_zone   |         11        |
|   2   |   bulls_eye   |         14        |
|   2   |    war_zone   |         17        |
|   2   |  speed_blitz  |         20        |
+-------+---------------+-------------------+

# Question 7 
    Find the top 3 scores based on each `Dev_ID` and rank them in increasing order using 
    `Row_Number`. Display the difficulty as well.

In [14]:
%%sql 

WITH Scores AS (
    SELECT ROW_NUMBER() OVER(PARTITION BY Dev_ID ORDER BY Score ASC ) AS Rank_1, Dev_ID, Difficulty, Score
    FROM level_details2 
)

SELECT Dev_ID, Difficulty, Score, Rank_1
FROM Scores
WHERE Rank_1 <= 3

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

30 rows affected.

+--------+------------+-------+--------+
| Dev_ID | Difficulty | Score | Rank_1 |
+--------+------------+-------+--------+
| bd_013 | Difficult  |  100  |   1    |
| bd_013 | Difficult  |  100  |   2    |
| bd_013 |    Low     |  540  |   3    |
| bd_015 |    Low     |  380  |   1    |
| bd_015 |   Medium   |  1050 |   2    |
| bd_015 | Difficult  |  1300 |   3    |
| bd_017 |    Low     |  390  |   1    |
| bd_017 |   Medium   |  1750 |   2    |
| bd_017 |    Low     |  2400 |   3    |
| rf_013 |   Medium   |  100  |   1    |
+--------+------------+-------+--------+
Truncated to displaylimit of 10.

# Question 8
    Find the `first_login` datetime for each device ID.

In [15]:
%%sql 

SELECT Dev_ID, MIN(start_datetime) AS first_login
FROM level_details2 
GROUP BY Dev_ID

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

10 rows affected.

+--------+---------------------+
| Dev_ID |     first_login     |
+--------+---------------------+
| bd_013 | 2022-10-11 02:23:45 |
| bd_017 | 2022-10-12 07:30:18 |
| rf_013 | 2022-10-11 05:20:40 |
| rf_017 | 2022-10-11 09:28:56 |
| zm_015 | 2022-10-11 14:05:08 |
| zm_017 | 2022-10-11 14:33:27 |
| bd_015 | 2022-10-11 18:45:55 |
| rf_015 | 2022-10-11 19:34:25 |
| zm_013 | 2022-10-11 13:00:22 |
| wd_019 | 2022-10-12 23:19:17 |
+--------+---------------------+
Truncated to displaylimit of 10.

# Question 9
    Find the top 5 scores based on each difficulty level and rank them in increasing order 
    using `Rank`. Display `Dev_ID` as well.

In [16]:
%%sql 

WITH Scores AS (
    SELECT RANK() OVER(PARTITION BY Difficulty ORDER BY Score ASC ) AS Rank_2, Dev_ID, Difficulty, Score
    FROM level_details2 
)

SELECT Dev_ID, Difficulty, Score, Rank_2
FROM Scores
WHERE Rank_2 <= 5

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

15 rows affected.

+--------+------------+-------+--------+
| Dev_ID | Difficulty | Score | Rank_2 |
+--------+------------+-------+--------+
| zm_017 | Difficult  |  100  |   1    |
| bd_013 | Difficult  |  100  |   1    |
| bd_013 | Difficult  |  100  |   1    |
| wd_019 | Difficult  |  100  |   1    |
| rf_013 | Difficult  |  235  |   5    |
| zm_017 |    Low     |   50  |   1    |
| zm_017 |    Low     |   70  |   2    |
| rf_013 |    Low     |  105  |   3    |
| rf_015 |    Low     |  150  |   4    |
| bd_015 |    Low     |  380  |   5    |
+--------+------------+-------+--------+
Truncated to displaylimit of 10.

# Question 10
    Find the device ID that is first logged in (based on `start_datetime`) for each player 
    (`P_ID`). Output should contain player ID, device ID, and first login datetime

In [17]:
%%sql 

SELECT 
    p.P_ID,
    ld.Dev_ID,
    ld.start_datetime AS first_login_datetime
FROM 
    (SELECT P_ID, MIN(start_datetime) AS first_login
     FROM level_details2 
     GROUP BY P_ID) AS p
JOIN 
    level_details2 AS ld 
ON 
    p.P_ID = ld.P_ID 
AND 
    p.first_login = ld.start_datetime;

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

22 rows affected.

+------+--------+----------------------+
| P_ID | Dev_ID | first_login_datetime |
+------+--------+----------------------+
| 211  | bd_017 | 2022-10-12 13:23:45  |
| 224  | rf_017 | 2022-10-14 01:15:56  |
| 242  | bd_013 | 2022-10-13 01:14:29  |
| 292  | rf_013 | 2022-10-12 04:29:45  |
| 296  | zm_017 | 2022-10-14 15:15:15  |
| 300  | rf_013 | 2022-10-11 05:20:40  |
| 310  | rf_017 | 2022-10-11 15:15:15  |
| 319  | zm_017 | 2022-10-12 14:20:40  |
| 358  | zm_017 | 2022-10-14 05:05:05  |
| 368  | zm_015 | 2022-10-12 01:14:34  |
+------+--------+----------------------+
Truncated to displaylimit of 10.

# Question 11
    For each player and date, determine how many `kill_counts` were played by the player 
    so far.
    a) Using window functions
    b) Without window functions

In [18]:
%%sql 

# WITH WINDOWS FUNCTION
SELECT P_ID, start_datetime, SUM(Kill_Count) OVER (PARTITION BY P_ID, start_datetime ORDER BY P_ID) AS total_kill_counts
FROM level_details2

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

77 rows affected.

+------+---------------------+-------------------+
| P_ID |    start_datetime   | total_kill_counts |
+------+---------------------+-------------------+
| 211  | 2022-10-12 13:23:45 |         20        |
| 211  | 2022-10-12 18:30:30 |         25        |
| 211  | 2022-10-13 05:36:15 |         30        |
| 211  | 2022-10-13 22:30:18 |         14        |
| 211  | 2022-10-14 08:56:24 |         9         |
| 211  | 2022-10-15 11:41:19 |         15        |
| 224  | 2022-10-14 01:15:56 |         20        |
| 224  | 2022-10-14 08:21:49 |         34        |
| 224  | 2022-10-15 05:30:28 |         30        |
| 224  | 2022-10-15 13:43:50 |         28        |
+------+---------------------+-------------------+
Truncated to displaylimit of 10.

In [19]:
%%sql 
# WITHOUT WINDOWS FUNCTION
SELECT P_ID, start_datetime, SUM(Kill_Count)AS total_kill_counts
FROM level_details2 
GROUP BY P_ID, start_datetime
ORDER BY P_ID

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

77 rows affected.

+------+---------------------+-------------------+
| P_ID |    start_datetime   | total_kill_counts |
+------+---------------------+-------------------+
| 211  | 2022-10-12 13:23:45 |         20        |
| 211  | 2022-10-12 18:30:30 |         25        |
| 211  | 2022-10-13 05:36:15 |         30        |
| 211  | 2022-10-13 22:30:18 |         14        |
| 211  | 2022-10-14 08:56:24 |         9         |
| 211  | 2022-10-15 11:41:19 |         15        |
| 224  | 2022-10-14 01:15:56 |         20        |
| 224  | 2022-10-14 08:21:49 |         34        |
| 224  | 2022-10-15 05:30:28 |         30        |
| 224  | 2022-10-15 13:43:50 |         28        |
+------+---------------------+-------------------+
Truncated to displaylimit of 10.

# Question 12
    Find the cumulative sum of stages crossed over `start_datetime` for each `P_ID`, 
    excluding the most recent `start_datetime`.

In [20]:
%%sql 
WITH RankedStages AS (
    SELECT 
        P_ID,
        start_datetime,
        Stages_crossed,
        ROW_NUMBER() OVER (PARTITION BY P_ID ORDER BY start_datetime DESC) AS rn
    FROM level_details2
)
SELECT 
    P_ID,
    start_datetime,
    SUM(stages_crossed) OVER (PARTITION BY P_ID ORDER BY start_datetime ASC ) AS cumulative_stages_crossed
FROM 
    RankedStages
WHERE 
    rn > 1;

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

55 rows affected.

+------+---------------------+---------------------------+
| P_ID |    start_datetime   | cumulative_stages_crossed |
+------+---------------------+---------------------------+
| 211  | 2022-10-12 13:23:45 |             4             |
| 211  | 2022-10-12 18:30:30 |             9             |
| 211  | 2022-10-13 05:36:15 |             14            |
| 211  | 2022-10-13 22:30:18 |             19            |
| 211  | 2022-10-14 08:56:24 |             26            |
| 224  | 2022-10-14 01:15:56 |             7             |
| 224  | 2022-10-14 08:21:49 |             12            |
| 224  | 2022-10-15 05:30:28 |             22            |
| 242  | 2022-10-13 01:14:29 |             6             |
| 292  | 2022-10-12 04:29:45 |             4             |
+------+---------------------+---------------------------+
Truncated to displaylimit of 10.

# Question 13
    Extract the top 3 highest sums of scores for each `Dev_ID` and the corresponding `P_ID`.

In [21]:
%%sql 

WITH RankedScores AS (
    SELECT
        P_ID,
        Dev_ID,
        SUM(Score) AS total_score,
        ROW_NUMBER() OVER (PARTITION BY Dev_ID ORDER BY SUM(Score) DESC) AS rank_1
    FROM
        level_details2
    GROUP BY
        P_ID, Dev_ID
)
SELECT
    Dev_ID,
     P_ID,
    total_score
FROM
    RankedScores
WHERE
    rank_1 <= 3;

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

30 rows affected.

+--------+------+-------------+
| Dev_ID | P_ID | total_score |
+--------+------+-------------+
| bd_013 | 224  |     9870    |
| bd_013 | 310  |     3370    |
| bd_013 | 211  |     3200    |
| bd_015 | 310  |     5300    |
| bd_015 | 683  |     3200    |
| bd_015 | 368  |     1950    |
| bd_017 | 590  |     2400    |
| bd_017 | 644  |     1750    |
| bd_017 | 211  |     390     |
| rf_013 | 368  |     2970    |
+--------+------+-------------+
Truncated to displaylimit of 10.

# Question 14
    14. Find players who scored more than 50% of the average score, scored by the sum of 
    scores for each `P_ID`.

In [22]:
%%sql

WITH PlayerAverageScore AS (
    SELECT
        P_ID,
        AVG(Score) AS average_score
    FROM
        level_details2
    GROUP BY
        P_ID
)
SELECT
    t1.P_ID,
    t1.Score,
    t2.average_score
FROM
    level_details2 AS t1
JOIN
    PlayerAverageScore AS t2 
ON t1.P_ID = t2.P_ID
WHERE
    t1.Score > 0.5 * t2.average_score;

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

61 rows affected.

+------+-------+---------------+
| P_ID | Score | average_score |
+------+-------+---------------+
| 211  |  3200 |   1823.3333   |
| 211  |  2700 |   1823.3333   |
| 211  |  1100 |   1823.3333   |
| 211  |  2800 |   1823.3333   |
| 224  |  5300 |   4077.5000   |
| 224  |  4570 |   4077.5000   |
| 224  |  5140 |   4077.5000   |
| 242  |  2840 |   3155.0000   |
| 242  |  3470 |   3155.0000   |
| 292  |  1890 |   1280.0000   |
+------+-------+---------------+
Truncated to displaylimit of 10.

# Question 15
    Create a stored procedure to find the top `n` `headshots_count` based on each `Dev_ID` 
    and rank them in increasing order using `Row_Number`. Display the difficulty as well.

In [23]:
%%sql 

CREATE PROCEDURE GetTopHeadshots(
    IN num INT -- Number of top headshots to retrieve
)
BEGIN
    SET @sql = CONCAT('
        SELECT 
            Dev_ID,
            Difficulty,
            Headshots_count,
            ROW_NUMBER() OVER (PARTITION BY Dev_ID ORDER BY Headshots_count ASC) AS rank_22
        FROM 
            level_details2
        ORDER BY
            Dev_ID, Headshots_count ASC
        LIMIT ', num, ';
    ');

    PREPARE stmt FROM @sql;
    EXECUTE stmt;
    DEALLOCATE PREPARE stmt;
END;

Running query in 'mysql+pymysql://root:***@127.0.0.4:3306/game_analysis'

++
||
++
++